---
type: IExportContext2D
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# IExportContext2D

`Autodesk.Revit.DB.IExportContext2D` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | OnElementBegin2D | 2020 | `RenderNodeAction OnElementBegin2D ( ElementNode node )` |
| Method | OnElementEnd2D | 2020 | `void OnElementEnd2D ( ElementNode node )` |
| Method | OnFaceEdge2D | 2020 | `RenderNodeAction OnFaceEdge2D ( FaceEdgeNode node )` |
| Method | OnFaceSilhouette2D | 2020 | `RenderNodeAction OnFaceSilhouette2D ( FaceSilhouetteNode node )` |